---
kind: property
id: P:Autodesk.Revit.DB.HomeCamera.UpDirection
source: html/4dd9810e-70a8-9ab4-71e1-33d30ab5592a.htm
---
# Autodesk.Revit.DB.HomeCamera.UpDirection Property

The up direction vector.

## Syntax (C#)
```csharp
public XYZ UpDirection { get; }
```